app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ( customer_id = '1' AND delivery_status = NULL AND recharge_status = NULL )
SELECT * FROM "items" ORDER BY items.id DESC LIMIT 1
---
  def index
    @clientparams = params[:client]
    @delparams = params[:delivered]
    @chargeparams = params[:recharged]

    if params[:client] != nil
      @clientsort = Item.find(:all, :conditions =>{:customer_id => params[:client]})
    else
      @clientsort = Item.all

INSERT INTO "items" ("price", "delivery_status", "recharge_status", "created_at", "delivery_date", "updated_at", "invoice_id", "purchase_id", "description", "customer_id") VALUES(10.0, 'f', 'f', '2010-11-25 18:27:39', '2010-11-25', '2010-11-25 18:27:39', NULL, NULL, 'test item', 1)
---
  def create
    @item = Item.new(params[:item])

    respond_to do |format|
      if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 1)
DELETE FROM "items" WHERE "id" = 1
---
  def destroy
    @item = Item.find(params[:id])
    @parent = @item.purchase_id
    @item.destroy