app/controllers/purchases_controller.rb

SELECT * FROM "purchases"
---
  def index
    @purchases = Purchase.all

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
---
  def show
    @purchase = Purchase.find(params[:id])

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
---
  def edit
    @purchase = Purchase.find(params[:id])

INSERT INTO "purchases" ("created_at", "supplier_invoice_id", "updated_at", "purchase_date", "user_id", "delivered_to_cust", "supplier_id") VALUES('2010-11-24 18:32:43', NULL, '2010-11-24 18:32:43', '2010-11-24', 1, 'f', 1)
---
  def create
    @purchase = Purchase.new(params[:purchase])

    respond_to do |format|
      if @purchase.save

SELECT * FROM "purchases" WHERE ("purchases"."id" = 11)
UPDATE "purchases" SET "updated_at" = '2010-11-26 17:58:42', "supplier_id" = 2 WHERE "id" = 27
---
  def update
    @purchase = Purchase.find(params[:id])

    respond_to do |format|
      if @purchase.update_attributes(params[:purchase])

SELECT * FROM "purchases" WHERE ("purchases"."id" = 1)
DELETE FROM "purchases" WHERE "id" = 1
---
  def destroy
    @purchase = Purchase.find(params[:id])
    @purchase.destroy